import { Footer } from "../components/Footer"
import { Logo } from "../components/menu/logo"

export const Rules:React.FC = () =>{
    return <section className="rules" style={{position:"relative"}}>
        <div className="rules__logo">
            <Logo variant="default"/>
        </div>
        <h1 className="rules__title">
        Правила користування сервісом <br/> StudLab
        </h1>
        <section className="rules__description" style={{paddingBottom:"240px"}}>
            <h1>1.Загальні положення</h1>
            <br/>
            <h1>1.1. Ці правила користування сервісом StudLab (далі - "Правила") встановлюють умови користування сервісом, які користувачі зобов'язані дотримуватися.
            <br/>1.2. Користуючись сервісом StudLab, користувач підтверджує свою згоду з цими Правилами.</h1>
            <br/>
            <h1>2.Обов'язки користувачів</h1>
            <br/>
            <h1>2.1. Користувачі StudLab зобов'язані поважати права та свободи інших користувачів сервісу.
            <br/>2.2. Користувачі не можуть:
            <br/>2.2.1. Публікувати коментарі, які містять образи, приниження або дискримінацію за будь-якою ознакою. 
            <br/>2.2.2. Розміщувати спам, флуд та рекламні матеріали без попередньої згоди адміністрації StudLab. 
            <br/>2.2.3. Порушувати авторські права та суміжні права третіх осіб. 
            <br/>2.2.4. Використовува ти сервіс StudLab для розповсюдження шкідливого програмного забезпечення. 
            <br/>2.2.5. Здійснювати будь-які дії, які можуть завдати шкоди StudLab, іншим користувачам або третім особам.</h1>
            <br/>
            <h1>3.Відповідальність користувачів</h1>
            <br/>
            <h1>4.Відповідальність адміністрації</h1>
            <br/>
            <h1>5.Зміни в Правилах</h1>
            <br/>
            <h1>6.Вирішення суперечок</h1>
            <br/>
            <h1>7.Зворотний зв'язок</h1>
            <br/>
            <h1>8.Конфіденційність та захист даних</h1>
            <br/>
            <h1>9.Форс-мажорні обставини</h1>
            <br/>
            <h1>10.Відмова від гарантій</h1>
            <br/>
            <h1>11.Введення в дію Правил</h1>
            <br/>
            <h1>12.Прийняття Правил</h1>
            <br/>
            <h1>12.1. Користувачем вважається будь-яка особа, яка користується сервісом StudLab або має намір скористатися ним.
            <br/>12.2. Користуючись сервісом StudLab, користувач підтверджує, що повністю прочитав, зрозумів і приймає ці Правила користування сервісом StudLab без будь-яких обмежень та застережень.</h1>
            <br/>
            <h1>13.Контактна інформація</h1>
            <br/>
            <h1>13.1. У разі виникнення питань або пропозицій з приводу цих Правил або роботи сервісу StudLab, користувачі можуть звертатися до адміністрації за вказаною контактною інформацією на сайті StudLab або інших офіційних ресурсах сервісу.</h1>
            </section>
            <Footer/>
    </section>
}